In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
pokemons = {
    "Height": np.random.randint(1,100,5),
    "Weight": np.random.randint(50,150,5),
    "Power": np.random.randint(200,250,5),
}

In [3]:
pokemons

{'Height': array([86, 81, 23, 34, 54]),
 'Weight': array([105,  58, 148,  69, 149]),
 'Power': array([222, 246, 205, 237, 235])}

In [4]:
df = pd.DataFrame(pokemons)

In [5]:
print(df)

   Height  Weight  Power
0      86     105    222
1      81      58    246
2      23     148    205
3      34      69    237
4      54     149    235

In [6]:
df.head()

   Height  Weight  Power
0      86     105    222
1      81      58    246
2      23     148    205
3      34      69    237
4      54     149    235

In [7]:
df.head(3)

   Height  Weight  Power
0      86     105    222
1      81      58    246
2      23     148    205

In [8]:
df.columns

Index(['Height', 'Weight', 'Power'], dtype='object')

In [9]:
df.to_csv('P_Data.csv',index="false")

In [10]:
df = pd.read_csv("P_Data.csv")

In [11]:
df.head()

   Unnamed: 0  Height  Weight  Power
0           0      86     105    222
1           1      81      58    246
2           2      23     148    205
3           3      34      69    237
4           4      54     149    235

In [21]:
df = df.drop(columns=['Unnamed: 0'])

In [22]:
df.shape

(5, 3)

In [23]:
df.head()

   Height  Weight  Power
0      86     105    222
1      81      58    246
2      23     148    205
3      34      69    237
4      54     149    235

In [28]:
df.tail(3)

   Height  Weight  Power
2      23     148    205
3      34      69    237
4      54     149    235

In [25]:
df.describe()

          Height      Weight       Power
count   5.000000    5.000000    5.000000
mean   55.600000  105.800000  229.000000
std    27.844209   42.681378   15.921683
min    23.000000   58.000000  205.000000
25%    34.000000   69.000000  222.000000
50%    54.000000  105.000000  235.000000
75%    81.000000  148.000000  237.000000
max    86.000000  149.000000  246.000000

In [26]:
df.iloc[3]

Height     34
Weight     69
Power     237
Name: 3, dtype: int64

In [27]:
df.iloc[3,1]

69

In [29]:
df

   Height  Weight  Power
0      86     105    222
1      81      58    246
2      23     148    205
3      34      69    237
4      54     149    235

In [31]:
df.sort_values(by=['Height','Power'],ascending=False)

   Height  Weight  Power
0      86     105    222
1      81      58    246
4      54     149    235
3      34      69    237
2      23     148    205

In [32]:
data_array = df.values

In [33]:
type(data_array)

numpy.ndarray

In [34]:
data_array

array([[ 86, 105, 222],
       [ 81,  58, 246],
       [ 23, 148, 205],
       [ 34,  69, 237],
       [ 54, 149, 235]])

In [35]:
data_array.shape

(5, 3)

In [36]:
new_df = pd.DataFrame(data_array,dtype='int32',columns=['Physics', 'Maths', 'Chemistry'])

In [37]:
new_df

   Physics  Maths  Chemistry
0       86    105        222
1       81     58        246
2       23    148        205
3       34     69        237
4       54    149        235

In [39]:
new_df.to_csv('PCM.csv',index=False)

In [40]:
pcm = pd.read_csv('PCM.csv')

In [41]:
pcm

   Physics  Maths  Chemistry
0       86    105        222
1       81     58        246
2       23    148        205
3       34     69        237
4       54    149        235